OpenFOAM-7-master/tutorials/combustion/fireFoam/LES/oppositeBurningPanels/0/ph_rgh.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ph_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    ground
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    burner
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    top
    {
        type            fixedValue;
        value           $internalField;
    }

    sides
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    "(region0_to.*)"
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
}


// ************************************************************************* //
